README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2015-09-02 Wed 08:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Andreas Larsen" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Small rpn based parser and interpreter written in java</a>
<ul>
<li><a href="#sec-1-1">1.1. Buildt-in math functions</a></li>
<li><a href="#sec-1-2">1.2. Variables</a></li>
<li><a href="#sec-1-3">1.3. Datatypes</a></li>
<li><a href="#sec-1-4">1.4. About the parsing algorithm</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Small rpn based parser and interpreter written in java</h2>
<div class="outline-text-2" id="text-1">
<p>
Written in 2 hours as a fun sideproject for learning java.
Small cli based parser and interpreter that takes in a line of input as a mathematical expression.
Each instance of the program has its own set of variables which can be set with the assign function or with the assignment operator '='
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Buildt-in math functions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The interpreter currently supports the following buildt-in mathematical functions:
</p>
<ul class="org-ul">
<li>sin,cos,tan
</li>
<li>asin,acos,atan
</li>
<li>sqrt
</li>
</ul>
<p>
There is also a no-argument function that returns a random number, called 'random()'
and a buildt-in function for displaying variables in the workspace 'vars()'
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Variables</h3>
<div class="outline-text-3" id="text-1-2">
<p>
All the variables are stored in a java HashMap, and can be named with the following convention: "[a-zA-Z][a-zA-Z0-9]*"
Variables are lazy evaled, however currently expressions are not.
</p>

<p>
This has the interesting effect that if you set a variable equal to ONLY another variable, it will become an alias for that variable,
which means that its value will allways be equal to the value of the variable it is aliased to, until you set it to something else.
</p>

<p>
When you start the program, it will create a new variable called pi, and put the value of pi in it.
Since there are no constants in the interpreter, it is possible to redifine the variable called pi. 
Doing so will not break any math functions as they calculate through the Java Math library.
It will however no longer be pi, which can be confusing, so it is advised to not redifine it.
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Datatypes</h3>
<div class="outline-text-3" id="text-1-3">
<p>
All numbers in the parser are standard Java Doubles.
Doubles are the only real datatypes you can interact with through the program, however there are technically 3 more datatypes:
</p>
<ul class="org-ul">
<li>Functions are stored as Strings
</li>
<li>Operators are stored as Characters
</li>
<li>Variables are also stored as Strings
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> About the parsing algorithm</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The algorithm used to parse is an slightly extended (to account for variables and multi argument functions) of the <a href="http://www.wikipedia.org/wiki/Shunting_Yard">shunting yard algorithm found on wikipedia</a>.
The algorithm works by using a Deque/Queue for the output (Im using an ArrayList here for simplicity), and a temporary stack for the operators.
The alogrithm implemented in the parser is as follows:
</p>
<ul class="org-ul">
<li>While there are still tokens left
<ul class="org-ul">
<li>if token is a String
<ul class="org-ul">
<li>if string is a function name, push it on the operator stack
</li>
<li>else add it to the end deque
</li>
</ul>
</li>
<li>if token is a number, push it to the end deque
</li>
<li>if token is a comma
<ul class="org-ul">
<li>while the top of the operator stack is not a ( or a comma
<ul class="org-ul">
<li>add the operator to the end deque
</li>
</ul>
</li>
<li>pop the ( or comma from the top of the stack
</li>
<li>push the new comma to the stack
</li>
</ul>
</li>
<li>if token is a (, push it to the operator stack
</li>
<li>if token is a )
<ul class="org-ul">
<li>same procedure as for comma
</li>
</ul>
</li>
<li>if token is whitespace, skip it
</li>
<li>if token is an operator
<ul class="org-ul">
<li>if the operator is left-associative
<ul class="org-ul">
<li>while top of operator stack has a priority lessthan or equal to tokens
<ul class="org-ul">
<li>pop operator from stack to end deque
</li>
</ul>
</li>
</ul>
</li>
<li>if the operator is right-associative do the same but with less than priority instead of less than or equal to
</li>
<li>finally push the new operator to the stack
</li>
</ul>
</li>
</ul>
</li>
<li>Pop the remaining operators to the end deque
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andreas Larsen</p>
<p class="date">Created: 2015-09-02 Wed 08:42</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
